In [4]:
import numpy as np
import pandas as pd

In [6]:
d = [1,2,3,4,5]
d_Series = pd.Series(d)
d_Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
d_df = pd.DataFrame(d)
d_df

   0
0  1
1  2
2  3
3  4
4  5

## 인덱스

In [9]:
d_df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
d_df.columns

RangeIndex(start=0, stop=1, step=1)

In [12]:
# 참고) 비공식적인 코드들이 많음!
# 비공식적인 부분 중 하나 : 내가 원하는 컬럼 이름
# FM : rename
# AM : 세로 인덱스에 접근해서 직접 값 변경
d_df.columns = ["col1"]
d_df

   col1
0     1
1     2
2     3
3     4
4     5

In [13]:
d_df["col1"]

0    1
1    2
2    3
3    4
4    5
Name: col1, dtype: int64

In [ ]:
# --> DataFrame 1개 컬럼을 선택하면 : 자료형이 바뀜
#     2D DF -> 1D 시리즈

## 새로운 커럼 추가

In [ ]:
# 할 일 : 새로운 컬럼 추가
# -> 전제 조건 : 기존에 DF이 있다고 전제하고
# df[컬럼명] = [여러 개 값]
# -> 새로운 컬럼명 추가의 AM 적인 방법 중 하나
#

In [15]:
d_df["NewCol2"] = d
d_df

   col1  NewCol2
0     1        1
1     2        2
2     3        3
3     4        4
4     5        5

In [30]:
d_df["NewCol3"] = 5 # 개수에 상관없이 줄 단위로 쭉 들어감.
d_df

   NewCol2  new  NewCol3
0        1    6        5
1        2    7        5
2        3    8        5
3        4    9        5
4        5   10        5

In [18]:
# 중요! 데이터를 처리할 때
# -> DF 기본적으로 수집된 데잍
# 이 수집된 특성/ 속성을 그대로 하는 것 말고 새로운 특징/속성을 만들어서 새로운 컬럼을 생성
# -> EDA의 가장 중요한 부분 ML의 성능에 영향을 미치는 부분 중 하나

# 작업을 할 때 기존의 컬럼/ 속성/ 특징들을 바탕으로 새로운 조합
# -> numpy의 벡터연산이 밑바닥에 있어서..
# 내가 하고자 하는 컬럼끼리의 관계만 생각하면 됨.

#컬럼 중심의 기능 중심으로 코드 작성을 하면 됨.

In [21]:
# 연습 가설) 기존 col1의 속성값 + newcol3 의 속성값을 합쳐서 새로운 컬럼으로 하는 게 더 좋을 것 같다.
d_df["new"] = d_df["col1"]+d_df["NewCol3"]
d_df

   col1  NewCol2  NewCol3  new
0     1        1        5    6
1     2        2        5    7
2     3        3        5    8
3     4        4        5    9
4     5        5        5   10

In [23]:
# 기존의 컬럼을 지울 때 : 컬럼을 지우는 방법이 여러가지 존재
# 방법1) 파이썬의 del 함수 이용 : dict 지울 때처럼.
#             del df[지울 컬럼]
#     --> 바로 지워져서 복구가 안됨;;;;
del d_df["col1"]
d_df

   NewCol2  NewCol3  new
0        1        5    6
1        2        5    7
2        3        5    8
3        4        5    9
4        5        5   10

In [24]:
# 방법2) pandas에 지우는 기능을 활용 : drop메서드!
# --> pandas 기본적으로 데이터를 핸들링을 위해서 만들었음
#     여러 시도, 테스트들을 하면서 결정을 하게 됨

# --> pandas의 기본적인 변경 관련된 메서들은 바로 적용x
#     inplace = T/F (재할당 없이 변경이 가능)

# --> 가로줄 제거 : axis = 0
#     세로줄 제거 : axis = 1

In [31]:
d_df.drop("NewCol3", axis =1, inplace = True)
d_df

   NewCol2  new
0        1    6
1        2    7
2        3    8
3        4    9
4        5   10

In [39]:
# 예) 가로줄 2번째 인덱스 데이터를 삭제!
d_df=d_df.drop(2)

In [40]:
d_df

   NewCol2  new
0        1    6
1        2    7
3        4    9
4        5   10

In [35]:
# 참고)
print(d_df.ndim)
print(d_df.shape) 
print(d_df.shape[0]) # --> 가로줄 갯수 정보 len(d_df)

2
(5, 2)
5

In [41]:
# 참고) 중간에 데이터가 빵구난 경우에 대해서... 어찌?
# 가로줄 단위로 처리 : 샘플 다누이처리하는 코드 작성 시 유의!
for i in range(len(d_df)):
    print(i)
    print(d_df[i, 1]) #가로줄 2가 없어서 에러 남.... --> re index 작업 해야함!!!!

0

KeyError: (0, 1)

In [43]:
for i in d_df.index: # 에러 안남
    print(i)

# 주의사항!
# 2차원 DF를 가로줄 단위로 갯수 중심으로 돌리 때
# 전제조건 : 가로줄 정수 인덱스가 누락없이 이어져 있을 때만!
#         ->reset_index() 누락된 거 처리하고 돌려야 함!

0
1
3
4

### 가상의 2D DataFrame 만들어보기 ###

In [146]:
# 주의! df이 약간 or틱게 운영을 해서 에러가 잘 안나지만 생성된 이후의 얘기니 처음 생성시에는
#     인덱스랑 데이터 개수가 맞아야 함.


stock_price_df =pd.DataFrame(
    data=[10000, 13000, 9900, 10500, 11000],
    index = ["2024-04-01","2024-04-02","2024-04-03","2024-04-04","2024-04-5"] 
)
stock_price_df

                0
2024-04-01  10000
2024-04-02  13000
2024-04-03   9900
2024-04-04  10500
2024-04-5   11000

In [147]:
# 1) 세로줄에 대한 나의 인덱스 부여 : 컬럼명 세팅!
# FM 방법 : rename (빈번하게 사용되는 기능!)
#         => 무엇을 무엇으로 바꾸겠따. dict
# rename 주의사항! => 에러를 잘 안 던짐
#                     진짜 바뀌는지 체크를 꼭 눈으로 해야함

In [148]:
stock_price_df.rename( columns = {0:"시가"})

               시가
2024-04-01  10000
2024-04-02  13000
2024-04-03   9900
2024-04-04  10500
2024-04-5   11000

In [149]:
stock_price_df #원본이 그대로 있음

                0
2024-04-01  10000
2024-04-02  13000
2024-04-03   9900
2024-04-04  10500
2024-04-5   11000

In [150]:
stock_price_df.rename( columns = {0:"시가"}, inplace= True) #할당해 True

In [151]:
stock_price_df

               시가
2024-04-01  10000
2024-04-02  13000
2024-04-03   9900
2024-04-04  10500
2024-04-5   11000

In [152]:
# 기존 df이 있는 상태에서
# 옆으로 컬럼을 추가하고 싶음
# 종가, 고가, 저가를 추가하고 싶음 ( 구체적인 속성을 추가 )
# 종가 컬럼 : 11000, 12000, 10000, 13000, 12000
# 고가 컬럼 : 13000, 15000, 15000, 18000, 17000
# 저가 컬럼 : 3000, 5000, 5000, 8000, 7000

stock_price_df["종가"]=[11000, 12000, 10000, 13000, 12000]
stock_price_df["고가"]=[13000, 15000, 15000, 18000, 17000]
stock_price_df["저가"]=[3000, 5000, 5000, 8000, 7000]

In [153]:
stock_price_df

               시가     종가     고가    저가
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000

In [55]:
# 2D에서 값에 대한 접근 FM
# 1개의 값에 대한 접근(at,iat) vs 여러 개의 값의 접근(loc, iloc)

# 단, 2차원이기 때문에 값에 대한 인덱스가 2개 필요!(가로, 세로)

In [57]:
stock_price_df.iat[0,1]

11000

In [58]:
stock_price_df.at["2024-04-01","종가"]

11000

In [59]:
# 내가 만든 것으로 인덱스 지정할지, 태생적으로 가진 정수값으로 인덱스 쓸지.
# *** 한 쪽으로 기준을 정하고 보는 것이 필요함(섞어서 못 씀)

In [235]:
stock_price_df

                S      E      H     L    GAP  GapFor  GapFor2  GapFor3
2024-04-01  10000  11000  13000  3000  10000   10000    10000    10000
2024-04-02  13000  12000  15000  5000  10000   10000    10000    10000
2024-04-03   9900  10000  15000  5000  10000   10000    10000    10000
2024-04-04  10500  13000  18000  8000  10000   10000    10000    10000
2024-04-5   11000  12000  17000  7000  10000   10000    10000    10000

In [237]:
col_dict = {"
"}

시가    S
종가    E
고가    H
저가    L
Name: 0, dtype: object

In [154]:
# 연습) rename을 이용해서 기존의 컬럼명을 시가:S, 종가:e, 고가:h, 저가:l 컬럼명 변경

colname = pd.DataFrame(
    data = ["S","E","H","L"],
    index = ["시가", "종가","고가","저가"]
)

stock_price_df.rename(columns = colname[0], inplace = True)
stock_price_df

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000

In [83]:
colname.index

Index(['시가', '종가', '고가', '저가'], dtype='object')

In [79]:
# 연습2) 다시 기존의 시가, 종가, 고가, 저가로 다시 컬럼명 변경하세요
stock_price_df.rename(columns = colname.index)

TypeError: 'list' object is not callable

In [85]:
stock_price_df.rename( index={"2024-04-5":"2024-04-05"})

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-05  11000  12000  17000  7000

In [86]:
# 연습3) 2024년 4월 3일의 시가와 고가의 가격은 얼마인가?
stock_price_df.loc["2024-04-03",["S","H"]]

S     9900
H    15000
Name: 2024-04-03, dtype: int64

In [87]:
stock_price_df.iloc[2,[0,2]]

S     9900
H    15000
Name: 2024-04-03, dtype: int64

In [90]:
# 참고) 원하는 컬럼명으로 위치 찾기
stock_price_df.columns.get_loc("S")

0

In [94]:
# 하드코딩 개선하기!
target_cols=["S","H"]
target_cols_idx= [ stock_price_df.columns.get_loc(col) for col in target_cols]
target_cols_idx

[0, 2]

In [95]:
stock_price_df.iloc[2,target_cols_idx]

S     9900
H    15000
Name: 2024-04-03, dtype: int64

In [97]:
# 연습4) 2024년 4워 1일부터 4일까지 시종고저 데이터는?
stock_price_df.loc["2024-04-01":"2024-04-04","S":"L"]
# 내가 만든 것으로 슬라이싱하면, 끝 점은 포함됨.

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000

In [101]:
stock_price_df.iloc[0:4,:]

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000

In [102]:
# 연습5) 모든 날짜의 시가하고 저가의 데이터만 보여줘
stock_price_df.loc[:,["S","L"]]

                S     L
2024-04-01  10000  3000
2024-04-02  13000  5000
2024-04-03   9900  5000
2024-04-04  10500  8000
2024-04-5   11000  7000

In [104]:
stock_price_df[["S","L"]] #속도가 느림 탐색용으로 사용

                S     L
2024-04-01  10000  3000
2024-04-02  13000  5000
2024-04-03   9900  5000
2024-04-04  10500  8000
2024-04-5   11000  7000

In [105]:
stock_price_df["S"] #시리즈 타입

2024-04-01    10000
2024-04-02    13000
2024-04-03     9900
2024-04-04    10500
2024-04-5     11000
Name: S, dtype: int64

In [107]:
stock_price_df[["S"]] #DF 타입

                S
2024-04-01  10000
2024-04-02  13000
2024-04-03   9900
2024-04-04  10500
2024-04-5   11000

In [109]:
# 기타 : .T.
stock_price_df

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000

In [ ]:
# 참고) pandas 에서는 가로줄에 대한 인덱스 중첨된 기능/ 유사기능
# -> 가로줄에 대한 인덱스 수정: 
#     rename ( index ~~~ ) : 기존 이름만 변경!
# -> 가로죽에 대한 인덱스 재설정: (전체적으로 싹 변경)
#     reindex() : 기존 인덱스를 버리고 새롭게 선택하는 것 같음 
# -> 가로줄에 대한 인덱스 완전 상태 변경 : reset_index

In [110]:
stock_price_df.reindex(["2024-04-01","2024-04-03"])

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-03   9900  10000  15000  5000

In [119]:
stock_price_df.drop("2024-04-02", inplace=True)

In [120]:
stock_price_df.reset_index()

        index      S      E      H     L
0  2024-04-01  10000  11000  13000  3000
1  2024-04-03   9900  10000  15000  5000
2  2024-04-04  10500  13000  18000  8000
3   2024-04-5  11000  12000  17000  7000

In [121]:
# 정렬!) 이미 만들어져있고, 잘 가져다 쓰자!
# pandas 정렬에 대한 기능을 제공
# --> 정렬에 대한 기준을 가로줄, 세로줄 선택
# 1. 가로줄 index 이름 중심 정렬/ 세로줄 columns 이름 중심 정렬
#     sort_index(axis = 0/1)
#     가로줄 이름으로 정렬할지, 세로줄의 이름으로 정렬할지

# 2. 값 자체 정렬을 할 때 : sort_values()

In [122]:
stock_price_df

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000

In [125]:
# 예) 컬럼명을 중심으로 정렬해서 df를 보겠다.
# -> sort_index
# -> 세로줄 : axis = 1
# -> 오름/내림 : ascending = T/F

stock_price_df.sort_index(axis=1, ascending =False)

                S     L      H      E
2024-04-01  10000  3000  13000  11000
2024-04-03   9900  5000  15000  10000
2024-04-04  10500  8000  18000  13000
2024-04-5   11000  7000  17000  12000

In [128]:
# 예) 데이터의 수집은 날짜별로 진행을 해서.. 
#     오래 전의 데이터가 상단에, 최근 데이터가 하단에 위치!
#--> 탐색을 하는데, 최신 데이터를 중심으로 보고 싶을 때
stock_price_df.sort_index(axis = 0, ascending = False)

                S      E      H     L
2024-04-5   11000  12000  17000  7000
2024-04-04  10500  13000  18000  8000
2024-04-03   9900  10000  15000  5000
2024-04-01  10000  11000  13000  3000

In [130]:
# 예)DF의 내부의 값을 중심으로 정렬!

stock_price_df.sort_values(by = "H", ascending = False)

                S      E      H     L
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000
2024-04-03   9900  10000  15000  5000
2024-04-01  10000  11000  13000  3000

In [132]:
# 예) 값을 가지고 정렬할 때 2번째 기준을 작성한다면
# -> 정렬을 기준들을 순서대로 세팅! 컬럼들의 순서를 지정!
stock_price_df.sort_values(by = ["H","S"],ascending = False)

                S      E      H     L
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000
2024-04-03   9900  10000  15000  5000
2024-04-01  10000  11000  13000  3000

In [155]:
# 참고) rank등수 선정 기능!
stock_price_df["E"].rank(method="max")

2024-04-01    2.0
2024-04-02    4.0
2024-04-03    1.0
2024-04-04    5.0
2024-04-5     4.0
Name: E, dtype: float64

In [ ]:
### *** 데이터를 전처리를 하는 과정에서 자주 사용되는 기능!
## 목적 : 줄 단위로 값들을 변경하거나 처리하는 일을 자주 함!
# -> 하려는 일이 줄 단위 뭔가 규칙이 있다.
# sorted(key = lambda x : ~)
# -> apply + lambda : 줄 단위로 무엇을 할지에 대한 기술!
    # ( : 개별 데이터를 신경쓰지 않고, 줄 단위에서 규칙을 중심으로)
# -> 코드의 가독성이 기능 중심으로 되어 있어서 편함!

In [161]:
stock_price_df

                S      E      H     L
2024-04-01  10000  11000  13000  3000
2024-04-02  13000  12000  15000  5000
2024-04-03   9900  10000  15000  5000
2024-04-04  10500  13000  18000  8000
2024-04-5   11000  12000  17000  7000

In [160]:
# -> 날짜별로 최고의 값들만 보고 싶음
#     체크 : 일단 하는 일이 줄 단위로 동일한지
#     기능 : 임의의 가로줄에서 여러 개 값들 중에서 최고 값을 선택
# apply(돌려주는) + lambda(할 일에 대한 기술)

stock_price_df.apply(lambda x : x.max(), axis=1)

2024-04-01    13000
2024-04-02    15000
2024-04-03    15000
2024-04-04    18000
2024-04-5     17000
dtype: int64

In [164]:
# -> 날짜별로 최고값과 최저값의 차이를 계산을 하고 싶다.
#     체크 : 일단 하는 일이 줄 단위로 동일하냐
#     기능 : 그 줄의 최고값  - 그 줄의 최저값
stock_price_df.apply(lambda x:x.max() - x.min(),axis=1)

2024-04-01    10000
2024-04-02    10000
2024-04-03    10000
2024-04-04    10000
2024-04-5     10000
dtype: int64

In [165]:
# -> 기존의 컬럼들의 값을 바탕으로 :기능적인 게산으로 처리된 값으로 컬럼을 추가할 때.. 함수!! 전처리!! ()

stock_price_df["GAP"] = stock_price_df.apply(lambda x:x.max() - x.min(),axis=1)
stock_price_df

                S      E      H     L    GAP
2024-04-01  10000  11000  13000  3000  10000
2024-04-02  13000  12000  15000  5000  10000
2024-04-03   9900  10000  15000  5000  10000
2024-04-04  10500  13000  18000  8000  10000
2024-04-5   11000  12000  17000  7000  10000

In [166]:
stock_price_df["GapFor"] = 0
stock_price_df

                S      E      H     L    GAP  GapFor
2024-04-01  10000  11000  13000  3000  10000       0
2024-04-02  13000  12000  15000  5000  10000       0
2024-04-03   9900  10000  15000  5000  10000       0
2024-04-04  10500  13000  18000  8000  10000       0
2024-04-5   11000  12000  17000  7000  10000       0

In [192]:
# lambda apply 를 쓰지 않고 반복문으로 gapfor 채워보기!
# df dptj batch 처리하는 기본적 구조, df에서 피요한 값에 접근, 갱신

for i in stock_price_df.index:
    stock_price_df.at[i,"GapFor"]=(max(stock_price_df.loc[i,])-min(stock_price_df.loc[i,]))

stock_price_df

                S      E      H     L    GAP  GapFor
2024-04-01  10000  11000  13000  3000  10000   10000
2024-04-02  13000  12000  15000  5000  10000   10000
2024-04-03   9900  10000  15000  5000  10000   10000
2024-04-04  10500  13000  18000  8000  10000   10000
2024-04-5   11000  12000  17000  7000  10000   10000

In [195]:
# 정답!
# 정수 인덱스 사용 : 
for i in range(len(stock_price_df)):
    # i 번째 가로줄에서 필요한 4개 값 가져오기
    data = stock_price_df.iloc[i,:4]
    # max-min
    temp = data.max() - data.min()
    # i번째 가로줄, 세로 GapFor 컬럼 위치에 5번째
    stock_price_df.iat[i,5] = temp

stock_price_df

                S      E      H     L    GAP  GapFor
2024-04-01  10000  11000  13000  3000  10000   10000
2024-04-02  13000  12000  15000  5000  10000   10000
2024-04-03   9900  10000  15000  5000  10000   10000
2024-04-04  10500  13000  18000  8000  10000   10000
2024-04-5   11000  12000  17000  7000  10000   10000

In [202]:
#정수로 세팅!
cols= ["S","E","H","L"]
cols_idx = [stock_price_df.columns.get_loc(col) for col in cols]

stock_price_df["GapFor2"] = 0
gap2_idx = stock_price_df.columns.get_loc("GapFor2")


for i in range(len(stock_price_df)):
    data = stock_price_df.iloc[i,cols_idx]
    stock_price_df.iat[i,gap2_idx] = data.max() - data.min()

stock_price_df

                S      E      H     L    GAP  GapFor  GapFor2
2024-04-01  10000  11000  13000  3000  10000   10000    10000
2024-04-02  13000  12000  15000  5000  10000   10000    10000
2024-04-03   9900  10000  15000  5000  10000   10000    10000
2024-04-04  10500  13000  18000  8000  10000   10000    10000
2024-04-5   11000  12000  17000  7000  10000   10000    10000

In [204]:
#방법2) 내가 만든 인덱스 기준
cols= ["S","E","H","L"]
result_col = "GapFor3"
stock_price_df[result_col]=0

for i in stock_price_df.index:
    data = stock_price_df.loc[i,cols]
    stock_price_df.at[i, result_col] = data.max()- data.min()

stock_price_df

                S      E      H     L    GAP  GapFor  GapFor2  GapFor3
2024-04-01  10000  11000  13000  3000  10000   10000    10000    10000
2024-04-02  13000  12000  15000  5000  10000   10000    10000    10000
2024-04-03   9900  10000  15000  5000  10000   10000    10000    10000
2024-04-04  10500  13000  18000  8000  10000   10000    10000    10000
2024-04-5   11000  12000  17000  7000  10000   10000    10000    10000

In [217]:
# 연습) 위에서 만든 df에서 날짜별로
# 시, 종 , 고, 저 가의 평균을 계싼해보세용

stock_price_df.iloc[:,:4].sum(axis=1)/stock_price_df.iloc[:,:4].shape[1]

2024-04-01     9250.0
2024-04-02    11250.0
2024-04-03     9975.0
2024-04-04    12375.0
2024-04-5     11750.0
dtype: float64

In [215]:
stock_price_df.iloc[:,:4].apply(lambda x: x.mean(),axis =1)

2024-04-01     9250.0
2024-04-02    11250.0
2024-04-03     9975.0
2024-04-04    12375.0
2024-04-5     11750.0
dtype: float64

In [ ]:
## *** 익숙하게 pandas 적용할 수 있어야 하는 기능 ***

# apply 관련 정리 -> 자주 사용되는 편한 기능! 
# -> 그 줄에 어떤 값들을 대상을 할지 생각을 정확하게 해야함
# df전체인지, 일부분df.loc[~~,~~]
# -> 대가 가로줄로 적용할지, 세로줄로 적용할지 axis = 1/0
# 결과는 타입상 에러가 없으면 뭐라도 나오니 꼭! 제대로 된 결과인지 체크하기

In [218]:
# # 간단하게 데이터를 볼 때
# -> 수치형 컬럼들에 한해서 기본적인 정보
#     평균, 표준편차, 4분위수...


stock_price_df.describe()

,S,E,H,L,GAP,GapFor,GapFor2,GapFor3
count,5.000000,5.000000,5.000000,5.000000,5.0,5.0,5.0,5.0
mean,10880.000000,11600.000000,15600.000000,5600.000000,10000.0,10000.0,10000.0,10000.0
std,1263.724654,1140.175425,1949.358869,1949.358869,0.0,0.0,0.0,0.0
min,9900.000000,10000.000000,13000.000000,3000.000000,10000.0,10000.0,10000.0,10000.0
25%,10000.000000,11000.000000,15000.000000,5000.000000,10000.0,10000.0,10000.0,10000.0
50%,10500.000000,12000.000000,15000.000000,5000.000000,10000.0,10000.0,10000.0,10000.0
75%,11000.000000,12000.000000,17000.000000,7000.000000,10000.0,10000.0,10000.0,10000.0
max,13000.000000,13000.000000,18000.000000,8000.000000,10000.0,10000.0,10000.0,10000.0

In [219]:
stock_price_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 2024-04-01 to 2024-04-5
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   S        5 non-null      int64
 1   E        5 non-null      int64
 2   H        5 non-null      int64
 3   L        5 non-null      int64
 4   GAP      5 non-null      int64
 5   GapFor   5 non-null      int64
 6   GapFor2  5 non-null      int64
 7   GapFor3  5 non-null      int64
dtypes: int64(8)
memory usage: 532.0+ bytes

In [221]:
#유니크 값 체크
len(stock_price_df.index.unique()) == len(stock_price_df)

True

In [222]:
from numpy import nan as NA

data = pd.DataFrame(
    data = [
        [1,6.5,3],
        [1,NA,NA],
        [NA,NA,NA],
        [NA, 6.5, 3]
    ]
)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [224]:
data.dropna() # 가로줄을 기준으로 모든 정보가 있는( 모든 컬럼 값이 있느 샘플)을 다 지움
                # 장점 : 샘플이 모든 속성값을 다 가지고 있음
                # 단점 : 샘플의 수가 확 줄어듬

     0    1    2
0  1.0  6.5  3.0

In [225]:
data #다이렉트로 반영되지 않음

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [230]:
# dropna 에서 axis: 가로,세로 줄 데이터들이 다 있는지 체크함.
# how : 결측값을 어떤 기준으로 제거할지.
#     how = "all" : 그 줄에 모든 값이 누락이 되어야만 제거!
# thresh : 정상데이터가 살아있는 기준의 개수

data.dropna(axis=0, how="all")

# 1개 이상의 정상 데이터가 있으면 샘플을 살리겠다
data.dropna(axis=0, thresh=1)
# 2개 이상
data.dropna(axis=0, thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [232]:
# fillna : 누락된 데이터를 채우자!
# -> 컬럼별로 누락된 데이터 채우기
# 예) 1번 컬럼의 누락데이터는 기본값을 0으로 채우자
#     2번 컬럼의 누락데이터는 기본값을 999로 채우고 싶다!
data.fillna(100)

       0      1      2
0    1.0    6.5    3.0
1    1.0  100.0  100.0
2  100.0  100.0  100.0
3  100.0    6.5    3.0

In [233]:
data.fillna({0:0, 1:999}) # 쌍의 구조로 dict 를 활용을 많이 함.

     0      1    2
0  1.0    6.5  3.0
1  1.0  999.0  NaN
2  0.0  999.0  NaN
3  0.0    6.5  3.0

## 정리

In [ ]:
# pandas의 기본적인 기능
# -> 값에 대한 FM접근 : at/iat, loc/iloc + 가로 세로 위치
# -> [조건식을 통한 불리언 인덱싱] : 필터링
# -> 줄 단위 전처리 : apply + lambda
# -> 잡다하게
#     1) 데이터 확인 : df.info(), df.describe()
#     2) 내가 만든 가로 인덱스, 세로 컬럼에 대한 변경 : rename
#     3) 값을 제거 : drop( 가로, 세로 지정) + 빵구난 데이터 지울 때 dropna()
#     4) 정렬 : 만든 인덱스 기준으로 정렬 sort_index(컬럼)
#               내부의 값을 기준으로 정렬 sort_values(by=[기준들..])
# *** apply+lambda 잘 활용하면 유용
# -> 대용량 데이터는 적합하지 않음


# +++ pandas 를 활용해서 외부 데이터를 가지고 오는 부분
# 파일 : csv, excel etc
# 웹 : json, xml, html etc + 통신관련된 통신모듈
    API, 사이트가 깔끔해서 수집이 용이한 사이트(정적), 불편한 사이트(동적)